Structural Applications/system/controlDictE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

//startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime        8.0;

deltaT          0.0005;


writeControl    runTime;
/*
adjustableRunTime
clockTime
cpuTime
runTime
timeStep
*/


writeInterval  1;

/*
secondaryWriteControl    cpuTime;
secondaryWriteInterval   1000; 
secondaryPurgeWrite      1; 
*/

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   15;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.4;

maxDeltaT       0.0005;

// ************************************************************************* //

functions
{

//////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////
//#includeFunc   probesReal
//#includeFunc   probesBetween
//#includeFunc   probesTPU
#includeFunc     probesIncident
///////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////



///////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////
fieldAverage
{
    // Mandatory entries (unmodifiable)
    type            fieldAverage;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    fields
    (
        U
        {
            mean        yes;
            prime2Mean  yes;
            base        time;
            
        }
       
    );

   
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         12;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    runTime;
    writeInterval   1;
 }
///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
yplus
{
       type yPlus;
       libs   ("libfieldFunctionObjects.so");
       writeControl  writeTime;
       log  false;
            }
	    }
libs ("libatmosphericModels.so");
    







