Structural Applications/system/probesBetween
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            (sampling);
writeControl    runTime;
writeInterval   0.001;

fields
(
    U
);

probeLocations
(
  (	0.8376	0.09	0.003	)
  (	0.8376	0.09	0.005	)
  (	0.8376	0.09	0.008	)
  (	0.8376	0.09	0.01	)
  (	0.8376	0.09	0.012	)
  (	0.8376	0.09	0.015	)
  (	0.8376	0.09	0.02	)
  (	0.8376	0.09	0.03	)
  (	0.8376	0.09	0.04	)
  (	0.8376	0.09	0.05	)
  (	0.8376	0.09	0.06	)
  (	0.8376	0.09	0.07	)
  (	0.8376	0.09	0.08	)
  (	0.8376	0.09	0.1	)
  (	0.8376	0.09	0.13	)
  (	0.8376	0.09	0.16	)
  (	0.8376	0.09	0.2	)
  (	0.8376	0.09	0.25	)
  (	0.8376	0.09	0.3	)
  (	0.8376	0.09	0.35	)
  (	0.8376	0.09	0.4	)
  (	0.8376	0.09	0.45	)
  (	1.0022	0.09	0.003	)
  (	1.0022	0.09	0.005	)
  (	1.0022	0.09	0.008	)
  (	1.0022	0.09	0.01	)
  (	1.0022	0.09	0.012	)
  (	1.0022	0.09	0.015	)
  (	1.0022	0.09	0.02	)
  (	1.0022	0.09	0.03	)
  (	1.0022	0.09	0.04	)
  (	1.0022	0.09	0.05	)
  (	1.0022	0.09	0.06	)
  (	1.0022	0.09	0.07	)
  (	1.0022	0.09	0.08	)
  (	1.0022	0.09	0.1	)
  (	1.0022	0.09	0.13	)
  (	1.0022	0.09	0.16	)
  (	1.0022	0.09	0.2	)
  (	1.0022	0.09	0.25	)
  (	1.0022	0.09	0.3	)
  (	1.0022	0.09	0.35	)
  (	1.0022	0.09	0.4	)
  (	1.0022	0.09	0.45	)
  (	1.1668	0.09	0.003	)
  (	1.1668	0.09	0.005	)
  (	1.1668	0.09	0.008	)
  (	1.1668	0.09	0.01	)
  (	1.1668	0.09	0.012	)
  (	1.1668	0.09	0.015	)
  (	1.1668	0.09	0.02	)
  (	1.1668	0.09	0.03	)
  (	1.1668	0.09	0.04	)
  (	1.1668	0.09	0.05	)
  (	1.1668	0.09	0.06	)
  (	1.1668	0.09	0.07	)
  (	1.1668	0.09	0.08	)
  (	1.1668	0.09	0.1	)
  (	1.1668	0.09	0.13	)
  (	1.1668	0.09	0.16	)
  (	1.1668	0.09	0.2	)
  (	1.1668	0.09	0.25	)
  (	1.1668	0.09	0.3	)
  (	1.1668	0.09	0.35	)
  (	1.1668	0.09	0.4	)
  (	1.1668	0.09	0.45	)
  (	1.3318	0.09	0.003	)
  (	1.3318	0.09	0.005	)
  (	1.3318	0.09	0.008	)
  (	1.3318	0.09	0.01	)
  (	1.3318	0.09	0.012	)
  (	1.3318	0.09	0.015	)
  (	1.3318	0.09	0.02	)
  (	1.3318	0.09	0.03	)
  (	1.3318	0.09	0.04	)
  (	1.3318	0.09	0.05	)
  (	1.3318	0.09	0.06	)
  (	1.3318	0.09	0.07	)
  (	1.3318	0.09	0.08	)
  (	1.3318	0.09	0.1	)
  (	1.3318	0.09	0.13	)
  (	1.3318	0.09	0.16	)
  (	1.3318	0.09	0.2	)
  (	1.3318	0.09	0.25	)
  (	1.3318	0.09	0.3	)
  (	1.3318	0.09	0.35	)
  (	1.3318	0.09	0.4	)
  (	1.3318	0.09	0.45	)
  (	1.4968	0.09	0.003	)
  (	1.4968	0.09	0.005	)
  (	1.4968	0.09	0.008	)
  (	1.4968	0.09	0.01	)
  (	1.4968	0.09	0.012	)
  (	1.4968	0.09	0.015	)
  (	1.4968	0.09	0.02	)
  (	1.4968	0.09	0.03	)
  (	1.4968	0.09	0.04	)
  (	1.4968	0.09	0.05	)
  (	1.4968	0.09	0.06	)
  (	1.4968	0.09	0.07	)
  (	1.4968	0.09	0.08	)
  (	1.4968	0.09	0.1	)
  (	1.4968	0.09	0.13	)
  (	1.4968	0.09	0.16	)
  (	1.4968	0.09	0.2	)
  (	1.4968	0.09	0.25	)
  (	1.4968	0.09	0.3	)
  (	1.4968	0.09	0.35	)
  (	1.4968	0.09	0.4	)
  (	1.4968	0.09	0.45	)
  (	1.6614	0.09	0.003	)
  (	1.6614	0.09	0.005	)
  (	1.6614	0.09	0.008	)
  (	1.6614	0.09	0.01	)
  (	1.6614	0.09	0.012	)
  (	1.6614	0.09	0.015	)
  (	1.6614	0.09	0.02	)
  (	1.6614	0.09	0.03	)
  (	1.6614	0.09	0.04	)
  (	1.6614	0.09	0.05	)
  (	1.6614	0.09	0.06	)
  (	1.6614	0.09	0.07	)
  (	1.6614	0.09	0.08	)
  (	1.6614	0.09	0.1	)
  (	1.6614	0.09	0.13	)
  (	1.6614	0.09	0.16	)
  (	1.6614	0.09	0.2	)
  (	1.6614	0.09	0.25	)
  (	1.6614	0.09	0.3	)
  (	1.6614	0.09	0.35	)
  (	1.6614	0.09	0.4	)
  (	1.6614	0.09	0.45	)
  

);

// ************************************************************************* //
